Tutorial_benchmark_1/constant/dynamicMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      dynamicMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dynamicFvMesh dynamicMotionSolverFvMesh; //Specially for FSI problems

motionSolverLibs ("libfvMotionSolvers.so");

solver      displacementLaplacian;
//solver      displacementInterpolation;
//solver      laplaceFaceDecomposition;

displacementLaplacianCoeffs {

    diffusivity quadratic inverseDistance (flap);
    //diffusivity inverseDistance (flap);
    //diffusivity uniform (flap);
    //diffusivity quadratic inverseVolume (flap);
}